---
kind: property
id: P:Autodesk.Revit.DB.Analysis.AnalysisDisplayMarkersAndTextSettings.TextTypeId
source: html/07caa14e-5efa-aeb4-f2b8-d20841b55656.htm
---
# Autodesk.Revit.DB.Analysis.AnalysisDisplayMarkersAndTextSettings.TextTypeId Property

Element id of text associated with the settings.

## Syntax (C#)
```csharp
public ElementId TextTypeId { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - When setting this property: A non-optional argument was null